<?xml version="1.0"?>
<net name="Model from PaddlePaddle." version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="?,?,?,3" element_type="u8" />
			<output>
				<port id="0" precision="U8" names="x">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="whswish_b_28.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_28.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="whswish_b_28.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="mobile_one_block_27.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_27.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="mobile_one_block_27.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="whswish_b_27.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_27.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="whswish_b_27.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="mobile_one_block_26.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="6" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_26.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="mobile_one_block_26.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="whswish_b_26.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="8" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_26.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="whswish_b_26.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="mobile_one_block_25.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="10" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_25.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="mobile_one_block_25.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="whswish_b_25.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="12" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_25.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="whswish_b_25.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="mobile_one_block_24.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="14" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_24.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="mobile_one_block_24.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="whswish_b_24.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="16" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_24.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="whswish_b_24.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="mobile_one_block_23.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="18" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_23.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="mobile_one_block_23.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="whswish_b_23.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="20" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_23.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="whswish_b_23.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="mobile_one_block_22.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="22" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_22.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="mobile_one_block_22.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="whswish_b_22.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="24" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_22.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="whswish_b_22.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="mobile_one_block_21.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="26" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_21.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="mobile_one_block_21.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="mobile_one_block_20.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="28" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_20.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="mobile_one_block_20.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="whswish_b_20.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="30" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_20.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="whswish_b_20.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="mobile_one_block_19.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="32" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_19.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="mobile_one_block_19.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="whswish_b_19.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="34" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_19.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="whswish_b_19.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="mobile_one_block_18.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="36" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_18.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="mobile_one_block_18.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="whswish_b_18.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="38" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_18.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="whswish_b_18.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="mobile_one_block_17.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="40" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_17.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="mobile_one_block_17.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="whswish_b_17.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="42" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_17.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="whswish_b_17.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="mobile_one_block_16.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="44" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_16.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="mobile_one_block_16.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="whswish_b_16.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="46" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_16.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="whswish_b_16.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="mobile_one_block_15.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="48" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_15.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="mobile_one_block_15.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="whswish_b_15.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="50" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_15.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="whswish_b_15.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="mobile_one_block_14.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="52" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_14.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="mobile_one_block_14.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="whswish_b_14.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="54" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_14.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="whswish_b_14.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="mobile_one_block_13.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="56" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_13.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="mobile_one_block_13.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="whswish_b_13.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="58" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_13.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="whswish_b_13.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="mobile_one_block_12.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="60" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_12.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="mobile_one_block_12.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="whswish_b_12.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="62" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_12.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="whswish_b_12.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="mobile_one_block_11.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="64" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_11.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="mobile_one_block_11.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="mobile_one_block_10.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="66" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_10.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="mobile_one_block_10.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="whswish_b_10.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="68" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_10.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="whswish_b_10.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="mobile_one_block_9.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="70" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_9.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="mobile_one_block_9.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="whswish_b_9.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="72" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_9.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="whswish_b_9.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="mobile_one_block_8.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="74" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_8.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="mobile_one_block_8.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="whswish_b_8.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="76" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_8.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="whswish_b_8.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="mobile_one_block_7.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="78" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_7.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="mobile_one_block_7.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="mobile_one_block_6.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="80" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_6.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="mobile_one_block_6.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="whswish_b_6.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="82" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_6.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="whswish_b_6.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="mobile_one_block_5.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="84" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_5.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="mobile_one_block_5.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="whswish_b_5.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="86" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_5.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="whswish_b_5.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="mobile_one_block_4.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="88" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_4.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="mobile_one_block_4.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="whswish_b_4.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="90" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_4.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="whswish_b_4.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="mobile_one_block_3.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="92" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_3.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="mobile_one_block_3.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="mobile_one_block_2.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="94" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_2.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="mobile_one_block_2.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="whswish_b_2.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="96" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_2.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="whswish_b_2.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="mobile_one_block_1.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="98" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_1.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="mobile_one_block_1.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="whswish_b_1.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="100" size="2" />
			<output>
				<port id="0" precision="FP16" names="whswish_b_1.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="whswish_b_1.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="mobile_one_block_0.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="20" size="2" />
			<output>
				<port id="0" precision="FP16" names="mobile_one_block_0.w_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="mobile_one_block_0.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Convert_2088" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Gather_3118_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 3" offset="102" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Gather_3118" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Subtract_2096" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Gather_3121_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 3" offset="108" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Gather_3121" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Divide_2098" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Divide_2098/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="114" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="113" name="Divide_2098/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="118" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="114" name="Divide_2098/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="114" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="Divide_2098/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="118" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="Divide_2098/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Divide_2098/fq_output_0/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="122" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="118" name="Divide_2098/fq_output_0/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="126" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="119" name="Divide_2098/fq_output_0/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="122" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="120" name="Divide_2098/fq_output_0/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="126" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="121" name="Divide_2098/fq_output_0/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_2099" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="130" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Transpose_2100" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_214441" type="Const" version="opset1">
			<data element_type="i8" shape="16, 3, 3, 3" offset="162" size="432" />
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Convert_214442" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_214443" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="594" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="p2o.Conv.0/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="p2o.Conv.0" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_450.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="p2o.Conv.0/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="658" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="130" name="p2o.Conv.0/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="662" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="131" name="p2o.Conv.0/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="658" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="132" name="p2o.Conv.0/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="662" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="133" name="p2o.Conv.0/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="p2o.Conv.0/fq_output_0/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="666" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="135" name="p2o.Conv.0/fq_output_0/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="670" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="136" name="p2o.Conv.0/fq_output_0/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="666" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="137" name="p2o.Conv.0/fq_output_0/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="670" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="138" name="p2o.Conv.0/fq_output_0/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="batch_norm2d_0.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="674" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm2d_0.w_0">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="batch_norm2d_0.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="batch_norm2d_0.b_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="706" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm2d_0.b_0">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="batch_norm2d_0.b_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="batch_norm2d_0.w_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="738" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm2d_0.w_1">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="batch_norm2d_0.w_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="batch_norm2d_0.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="770" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm2d_0.w_2">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="batch_norm2d_0.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="p2o.BatchNormalization.0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_67.tmp_2">
